Revit 2027 API
IFCLegacyStairOrRamp.GetNumberOfRisers Method
 Gets the number of risers.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetNumberOfRisers()
Public Function GetNumberOfRisers As IList(Of Integer)
public:
IList<int>^ GetNumberOfRisers()
member GetNumberOfRisers : unit -> IList<int>
Return Value
IList<Int32>
 The list of numbers of risers.
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace